'''
题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，

高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；

60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
'''
i = int(input('净利润:'))
arr = [1000000,600000,400000,200000,100000,0]
rat = [0.01,0.015,0.03,0.05,0.075,0.1]
r=0
for odx in range(len(arr)):
    if i>arr[odx]:#当剩下的部分还比arr列表中的值大时，再进行计算
        r+=(i-arr[odx])*rat[odx]#计算多出的部分
        print((i-arr[odx]),rat[odx])
        i=arr[odx]#把剩下的部分再赋值给i进行下一轮计算
print(r)
#可以列表嵌套
i = int(input('净利润:'))
arr = [[1000000,0.01],[600000,0.015],[400000,0.03],[200000,0.05],[100000,0.075],[0,0.1]]
r=0
for odx in range(len(arr)):
    if i>arr[odx][0]:#当剩下的部分还比arr列表中的值大时，再进行计算
        r+=(i-arr[odx][0])*arr[odx][1]#计算多出的部分
        print((i-arr[odx][0]),arr[odx][1])
        i=arr[odx][0]#把剩下的部分再赋值给i进行下一轮计算
print(r)
#另一种方法
i = int(input('净利润：'))
I = [1000000,600000,400000,200000,100000,0]
r = [0.01,0.015,0.03,0.05,0.075,0.1]
for j in range(len(I)):
        if i > I[j]:
          b = [0,0,0,0,0,0]
          b[j] = i -I[j]
          for k in range(j+1,len(I)):
              b[k] = I[k-1]-I[k]
          print(list(zip(b,r)))
          bonus = sum(map(lambda x:x[0]*x[1],zip(b,r)))
          break
print('奖金：',bonus)
